package Human;

// TODO: 26.03.2020
// 1)Разработать abstract class human.
// 2)Унаследовать его в 3 другие класса(которые будут использоваться в нашей системе хранения договоров)
// 3)Сделать интерфейс хранилища
// 4)Реализовать интерфейс хранилища в классе storage
// (добавить один default  метод  в интерфейс, понять зачем нужны default методы в интерфейсах)
// 5)Объявит в интерфейсе константу вместимость
// 6) Придумать пример из 5 классов иллюстрирующий восходящее преобразование и позднее связывание(придумать = написать и применить)
// 7) Переопределить метод toString() во всех классах проекта системы договоров
// Актуальный коммит в репозитории, если уже склонились нажмите pull/ он в idea рядом с push
public class Main {
}
